[
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/trading-tech",
    "title": "Trading Tech",
    "date_published": "2026-06-01",
    "author": null,
    "summary": "Latest Trading Tech articles on risk management, derivatives and complex finance",
    "full_text": "",
    "tags": [
      "risk-management",
      "trading"
    ],
    "relevance_score": 2,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/trading-tech/7952896/banks-hope-new-axe-platform-will-cut-bond-trading-costs",
    "title": "Banks hope new axe platform will cut bond trading costs",
    "date_published": "2026-06-01",
    "author": null,
    "summary": "Dealer-backed TP Icap venture aims to disrupt dominant trio of Bloomberg, MarketAxess and Tradeweb.",
    "full_text": "Dealers involved in the launch of a new credit trading platform are pinning a lot on its approaching debut. Rather than inviting dealers to quote prices, the new service will attempt to match sell- and buy-side participants that have offsetting interestsan unusual approach that banks hope will enable the venture to snatch market share from a trio of well-established incumbents. If it works, dealers will have a lower-cost alternative to those incumbentsBloomberg, MarketAxess and Tradeweb. That Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "technology",
      "trading"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/trading-tech/7952891/editors-picks-our-best-from-2025",
    "title": "Editors Picks: Our best from 2025",
    "date_published": "2025-12-30",
    "author": null,
    "summary": "Anthony Malakian picks out 10 stories from the past 12 months that set the stage for the new year.",
    "full_text": "Back in college, my favorite professor gave me some unsolicited advice. For the student-run newspaper, I mostly wrote for the sports section, covering the schools hockey, volleyball, and baseball teams. I envisioned myself one day banging out copy for the New York Post or New York Daily News. But one day in a pinch, I helped out the news section by covering some faculty or student association meetingI cant even remotely remember. What I do remember is that my professor pulled me aside and told Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "technology",
      "regulation"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/emerging-technologies/7952883/the-next-phase-of-ai-in-capital-markets-from-generative-to-agentic",
    "title": "The next phase of AI in capital markets: from generative to agentic",
    "date_published": "2025-12-26",
    "author": null,
    "summary": "A look at some of the more interesting projects involving advanced forms of AI from the past year.",
    "full_text": "Time moves fast, and that is no exception in the world of emerging technology, especially with artificial intelligence. If 2023 was the year of generative AI, 2024 was the year of its application, then 2025 could be deemed the year of Agentic. Or, as Microsofts director of capital markets AI and digital strategy, Symon Garfield, said in March: Generative AI is completely passé. Its two years old now; everybodys doing it.  This is the year of agentic AI. There does seem to be something of a Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "technology"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/emerging-technologies",
    "title": "Emerging Technologies",
    "date_published": "2026-07-01",
    "author": null,
    "summary": "Latest Emerging Technologies articles on risk management, derivatives and complex finance",
    "full_text": "",
    "tags": [
      "risk-management"
    ],
    "relevance_score": 2,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/trading-tech/7952873/will-overnight-trading-in-equity-markets-expand-next-year-its-complicated",
    "title": "Will overnight trading in equity markets expand next year? Its complicated.",
    "date_published": "2025-12-22",
    "author": null,
    "summary": "The potential for expanded overnight trading in US equity markets sparked debate this year, whether people liked it or not.",
    "full_text": "This past spring, a practice and tradition of almost 50 years came to an end. In late February, the New York Yankees announced they would be ending their longstanding policy on facial hair and grooming. For nearly five decades, Yankees players were mandated to be clean-shaven and without long hair. It was sometimes in stark contrast to the appearance of other players around the league (see: Brandon Marsh). The policy formally began in 1976 after owner George The Boss Steinbrenner was reportedly Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "technology",
      "trading"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/trading-tech/2132666/waterstechnology-latest-edition",
    "title": "WatersTechnology latest edition",
    "date_published": "2025-12-19",
    "author": null,
    "summary": "View the Q4 2025 issue of WatersTechnology.",
    "full_text": "View the Q4 2025 issue of WatersTechnology. View the Q3 2025 issue of WatersTechnology. View the Q2 2025 issue of WatersTechnology. View the Q1 2025 issue of WatersTechnology. View the Q4 2024 issue of WatersTechnology. View the Q3 2024 issue of WatersTechnology. View the Q2 2024 issue of WatersTechnology. View the Q1 2024 issue of WatersTechnology. View the Q4 2023 issue of WatersTechnology. View the Q3 2023 issue of WatersTechnology. View the Q2 2023 issue of WatersTechnology. View the Q1 2023 issue of Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "technology"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/trading-tech/7952863/the-total-portfolio-approach-gains-momentum-building-the-right-tech-foundation-for-success",
    "title": "The total portfolio approach gains momentum: Building the right tech foundation for success",
    "date_published": "2025-11-12",
    "author": null,
    "summary": "The rationale for the TPA, and the crucial role technology plays in enabling such an approach",
    "full_text": "Large investment managers are increasingly looking to manage their entire investment portfolios with a total portfolio approach (TPA). Oliver Johnson, chief revenue officer at SimCorp, explains the rationale for the trend and the crucial role technology plays in enabling such an approach. To what extent has the TPA model gained traction across the buy side and, typically, what types of buy-side firms have adopted the approach? Oliver Johnson, SimCorp: In nearly every conversation we have with asset ownerspension funds, sovereign funds or insurance companieswe end up talking about TPA. However, its not the same on the asset manager side. While TPA has been part of the conversation weve had with asset owners for quite some time, Id say its only now starting to become relevant for some of the larger global asset managers, because theyre looking to create more multi-asset strategies that span different asset classes and products. What weve seen across our client base is that adoption largely tracks operational maturity. Institutions with established data infrastructure and cross-functional governance structures progress faster than those still operating in asset class silos. What is driving this shift to TPA among asset owners? Are they looking for greater diversification and exposure to new markets and asset classes?Oliver Johnson: Thats a common misconception. Asset owners have been in private markets and alternatives for years. The shift to TPA is about optimizing across these asset classes. Theyve moved beyond the diversification phase and are now focused on how their entire portfolios work together to meet liquidity needs, risk allocations and return objectives. Traditionally, firms had separate teams for fixed income, equities and private markets, each running strategies against their own benchmarks. TPA changes that by evaluating all investments together within a unified framework, eliminating silos that create inefficiencies and blind spots. Its about extracting more value from existing allocations, not simply adding new ones. What are the technology and operational components firms need to have in place to develop a viable, coherent TPA? Oliver Johnson: To run your firm on a TPA, you have to rely on a robust technology infrastructure. You need to be able to manage all of your asset classes holistically, and you need a single source of truth that supports all the automated processes across the different asset classes. At the heart of this is SimCorps investment book of record (IBOR). It is ultimately the foundation that allows portfolio managers to see all of their asset classes in real time. The tech stack is critical, especially from a risk and liquidity management perspective, as portfolios become more complex with increased private market allocations. Real-time exposure visibility across all asset classes is now table stakes. The IBOR has been core to SimCorps DNA for more than 25 years. What was the original vision behind that? Oliver Johnson: That was the foundational decision at SimCorps inceptionto model every asset class natively from the ground up in the IBOR. That means all asset classes exist in the same book of record, a foundation that makes TPA possible. The alternative approachmultiple fragmented systems with a data warehouse layered on toponly brings positions together on an end-of-day basis for consolidated reporting. We call that a total portfolio glance. You cant perform risk, performance or compliance in real time with end-of-day data. For investment decisions throughout the day, you need a real-time view across all asset classes. How does SimCorp help clients transition from legacy systems to a unified platform that enables TPA? Oliver Johnson: Another misconception about TPA is that theres only one path to implementation. In reality, the approach depends entirely on each institutions operational readiness, risk tolerance and strategic priorities. We see two main approaches. For example, one large pension fund recently came to us with multiple systems and initially asked us to layer on top of its existing infrastructure. Through our workshops, they realized they needed to fix the problem at the source by capturing transactions in an integrated platform rather than reconciling outputs. The fund replaced its equity, fixed income, private markets and derivatives systems with SimCorp One in a comprehensive migration. Other clients prefer a phased approach. They often start with private markets, which typically has the weakest infrastructure, then migrate equities and fixed income once that first implementation is live. The industry agrees on the end-goal: an integrated front-to-back system supporting all asset classes. The question is whether to replace everything at once or migrate in phases. Industry consensus is clear: the foundation for TPA is an integrated front-to-back system supporting all asset classes. What varies is the path to get therecomprehensive replacement versus phased implementation. Time-to-market with new implementations is increasingly driving buy-side technology decisions. Firms want quick wins with phased deployments so that parts of the business can be up and running with at least some new functionality and minimal lag. Is that correct? Oliver Johnson: Absolutely. Were currently working with one of the industrys largest asset managers that chose a hybrid approach, which entailed implementing the IBOR across all asset classes first, as this is at the heart of everything, and then integrating it with its existing systems and decommissioning those systems over time. This gives the asset manager the unified data foundation immediately while managing organizational change incrementally. What differentiates SimCorps approach to IBOR and TPA from other providers in this space? Oliver Johnson: What sets SimCorp apart starts with how we define IBOR, as the term has become diluted in the market. Our definition is precise: a single source of truth for all public and private markets investments that updates in real time, not start-of-day positions, but an immediate reflection of every trade, corporate action and cash movement. That foundation defines our three core differentiators. First is our native multi-asset capability. We built every asset class from the ground up within the same platform. This isnt bolt-on functionality or acquired systems stitched togetherits integrated by design, which is essential when institutions need a unified view across their entire portfolios. Second is open architecture with more than 160 partners. SimCorp delivers the IBOR core and handles integration complexity, although clients can access specialized functionality where they need it. Axioma is a good example of this. When SimCorp and Axioma merged, we integrated what was already the markets leading risk management solution and portfolio optimizer, rather than building our own. And third is our proven enterprise delivery. Large institutions choose us for our 50-year track record of successful implementations at the most complex organizations worldwide. When youre replacing mission-critical infrastructure across multiple asset classes, execution risk matters as much as capability. Sponsored content Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "risk-management",
      "data-management",
      "technology",
      "operations",
      "regulation",
      "trading",
      "portfolio"
    ],
    "relevance_score": 5,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/trading-tech/7952866/google-cme-say-theyve-proved-cloud-can-support-hft-now-what",
    "title": "Google, CME say theyve proved cloud can support HFTnow what?",
    "date_published": "2025-10-12",
    "author": null,
    "summary": "After demonstrating in September that ultra-low-latency trading can be facilitated in the cloud, the exchange and tech giant are hoping to see barriers to entry",
    "full_text": "Long before electricity, ancient humans in the empty Northern Hemisphere looked to a dark winter sky and were stunned to find it had come alive with dancing green ribbons. What is now known as the northern lights, or the aurora borealis, was once thought to be a supernatural phenomenon, a message from the gods. In the mind of todays derivatives trader, a different Aurora holds a similar level of reverencespecifically the one in Illinois, where CME, the worlds largest futures and options Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "technology",
      "trading"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/trading-tech/7952857/institutional-priorities-in-multi-asset-investing",
    "title": "Institutional priorities in multi-asset investing",
    "date_published": "2025-09-12",
    "author": null,
    "summary": "Private markets, broader exposures and the race for integration",
    "full_text": "FIS The expansion of multi-asset investing marks a pivotal shift in institutional portfolio management as firms broaden their exposures beyond traditional public markets into private assets and alternatives. While this diversification reflects a search for alpha and resilience in higher-rate conditions, it also introduces new operational and data demands.A Risk.net survey of 52 institutions, commissioned by FIS, reveals that private markets lead expected allocation increases, with technology modernization emerging as the top investment priority. The results highlight clear contrasts across regions and organisational scales  from diversification-driven strategies in North America to alpha-focused approaches in the Asia-Pacific region  alongside differing approaches to execution and capability development.This report examines how institutions are adapting to the expanding multi-asset universe, the technology and skill investments shaping that evolution, and the operational integration required to manage increasingly complex portfolios coherently across public and private markets.Download Institutional priorities in multi-asset investing Sponsored content Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "technology",
      "operations",
      "trading",
      "portfolio"
    ],
    "relevance_score": 2,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/trading-tech/7952861/blackrock-and-accessfintech-partner-lseg-collabs-with-openai-apex-launches-pisces-service-and-more",
    "title": "BlackRock and AccessFintech partner, LSEG collabs with OpenAI, Apex launches Pisces service, and more",
    "date_published": "2025-05-12",
    "author": null,
    "summary": "The Waters Cooler: CJC launches MDC service, Centreon secures Sixth Street investment, UK bond CT update, and more in this week’s news roundup.",
    "full_text": "Mya Jheeta Japan Exchange Group Market data Artificial intelligence Emerging Technologies Waters Cooler Its officially December, so happy holidays, everyone! BlackRock, AccessFintech partner to enhance post-trade connectivity BlackRock has partnered with data and workflow collaboration network AccessFintech. Through BlackRocks Aladdin investment management platform, the firms aim to deliver bilateral connectivity and real-time post-trade collaboration between the global buy-side Aladdin platform community and more than 250 capital markets and asset servicing institutions already connected to AccessFintechs Synergy Network. This partnership seeks enable secure, API-first connectivity between buy-side firms and their counterparties, giving Aladdin clients real-time insight into trade lifecycle events. It delivers cross-asset, multi-region data with AI-driven analytics, accelerating remediation and reducing operational risk across securities, private markets (loans), and derivatives (swaps). BlackRock has also made a strategic capital investment in AccessFintech for an undisclosed sum. CJC launches 247 market data support service Market data technology consultancy and service provider Crown Jewels Consultants (CJC) has launched its Market Data Continuity (MDC) support service. MDC is a fixed monthly subscription and includes 247 access to CJCs global market data specialists, with a fixed number of on-site hours. Every support request is treated as a severity level 1 incident, ensuring triage and resolution by experts. MDC is designed for financial firms that cannot afford market data interruptions but do not need a full managed service. MDC addresses risks by giving clients priority access to senior engineers at CJC, who can diagnose and resolve issues remotely or on-site, without the long-term cost or commitment of a traditional managed service. Centreon secures Sixth Street investment to grow observability platform Centreon, a European provider of IT monitoring and observability solutions, announced a partnership with Sixth Street, a global investment firm. The platform was revealed during Centreons November Summit and will unify IT infrastructure monitoring, log management, and digital experience monitoring into a modular, open observability solution. With Sixth Streets support, Centreon aims to accelerate product innovation, enhance AI-driven automation, analytics, and full-stack observability. LSEG announces new collaboration with OpenAI The London Stock Exchange Group (LSEG) has released an Model Context Protocol (MCP) connector for ChatGPT users and enterprise customers of OpenAI, with plans to make ChatGPT Enterprise available for LSEG employees. The connector is expected to be live in ChatGPT next week. In an extension of its LSEG Everywhere strategy, the exchange will grant access to data licensed through its products, like Workspace and Financial Analytics, to ChatGPT users and enterprise customers. LSEGs AI-ready content will be accessible through an MCP-powered connector in a phased rollout, starting with LSEG Financial Analytics. ChatGPT users with licensed credentials will be able to access and analyze LSEG financial market data and news directly within the ChatGPT app. Following this first release, LSEG will provide ChatGPT users and enterprise customers with additional data categories and functionality. Path cleared for Etrading Software to deliver UK bond consolidated tape The suspension of the UK bond consolidated tape procurement process has been lifted, following a legal challenge by fintech Ediphy to the Financial Conduct Authoritys (FCAs) bidding process. Rival fintech Etrading Software, which was previously awarded the tape contract by the FCA, can proceed with building and delivering the tape. The UK bond tape is planned to go live on June 22, 2026. Over the coming months, Etrading Software will release technical specifications, publish contracts and fee levels, form a consultative committee, and launch a series of industry webinars to support preparation. It will also provide a detailed roadmap to assist the industry in preparing for the tapes launch. Apex launches Pisces services for LSEs private securities market Apex Group, a provider of fund and asset servicing solutions, has launched a Private Intermittent Securities and Capital Exchange System (Pisces) suite of services, which will include trade fulfillment as a registered auction agent (RAA) on the London Stock Exchanges Private Securities Market, operating under the Pisces framework. Announced earlier this year, Pisces enables the intermittent trading of secondary shares in private companies, helping private equity managers, corporates, founders, and employees access liquidity without requiring a full company sale. At the point of a secondary share sale, Apex Group will manage the trading process as an RAA, as well as provide licensing application support and customer and asset due diligence. TNS expands global market data access with connectivity to TFX Transaction Network Services (TNS) has expanded its global market data infrastructure in Asia-Pacific with connectivity to the Tokyo Financial Exchange (TFX), one of Japans derivatives exchanges. This collaboration provides TNS customers with direct access to TFX, delivered anywhere across TNS global network. The addition of TFX completes TNS connectivity across all major Japanese exchanges and offers domestic and international firms comprehensive, managed access to Japan from a single provider. TNS now delivers its full suite of services in Japan, including hosting, data, and connectivity. TNS Japanese exchange portfolio also includes Japannext and the Japan Exchange Group, which encompasses the Tokyo Stock Exchange, Osaka Exchange, and Tokyo Commodity Exchange. FactSet, Arcesium debut tech to unite front, middle, and back offices FactSet has strategically partnered with Arcesium, a provider of enterprise data management solutions, to deliver unified investment management for front-, middle-, and back-office asset management workflows across public, private, and alternative markets. By leveraging FactSets global data infrastructure and Arcesiums cloud-native technology, the partnership delivers data consistency and analytics. It combines FactSets advanced front- and middle-office analytics and portfolio management tools with Arcesiums back-office technology, including Investment Book of Record, Accounting Book of Record, and reference data solutions. Robeco tests credit tool built in Bloombergs Python platform Dutch asset manager Robeco is testing a credit cross-currency relative-value tool it built using BQuant, Bloombergs Python-based data science and analytics platform. The offering seeks to generate alpha by exploiting cross-currency spread differentials between bonds issued by the same issuer in different currencies and was built during Bloombergs Code Crunch Hackathon in Singapore. Randell Ho, a Robeco credit analyst, says there is room for improvement in the credit space, which doesnt have the same level of available data as other asset classes. During the hackathon, LGT Investment Management had also developed a multi-asset backtesting and quantitative dashboard to evaluate and test investment ideas. It participated in Code Crunch to test BQuants viability for developing custom applications. Waters Wavelength Ep. 341: Citis Pitts and Topa This weeks podcast guests are Citi Investor Services Michele Pitts, managing director and global product head of transaction management; and Marcello Topa, director for global market advocacy, policy, and strategy, who join Wei-Shen Wong to talk about UK and EU T1 settlement. CME, LSEG align on market data licensing in GenAI era The two major exchanges say they are licensing the use case, and not the technology, as the new era of GenAI creates unpredictability for market data managers about new licensing costs. This is critically important to both exchanges as market data fees and licensing costs have always been a point of contention with end-user firms, who see price increases nearly every year. For example, if a firm uses machine learning to manipulate transcript data of earnings calls, analyst briefings, and corporate presentations that they license from an exchange, data vendors dont license that data differently just because the firm uses machine learning. AI might be enabling new use cases, but automation, machine learning, and natural language processing have all been available for a decadewhy is generative AI any different? Its really just all of that on steroids, says Debbie Lawrence, group head of data strategy and management at LSEG. Chicago datacenter outage forced clearers to turn away clients An outage at a Chicago datacenter run by CyrusOne last week caused banks to turn away client trading and clearing business. Issues with a cooling system forced CME to take offline platforms used for its equity, foreign exchange, bond and commodity markets, and individual financial institutions with co-located servers were left in the same position. The incident has increased concerns about a risky combination of aging technology and the lack of substitutes if a large central counterparty (CCP) experiences an outage. An executive at one dealer, which had co-located servers for trading, says it had to suspend customer operations and take our servers offline until temperatures normalized to avoid causing damage. Tokenized assets draw interest, but regulation lags behind The US, EU, and the UK have shifted toward more blockchain-friendly messaging as the technology resurges. In the US, legal experts say the excitement about tokenization reflects financial firms recognition of blockchains potential, and an upcoming bill is expected to clear up confusion around classification of tokenized securities. But in Europe, the issue is more complex. The EU does not regulate tokenization through a single, centralized authority; instead, it allows its 27 member states to interpret EU laws within their own legal frameworks. Market readiness, infrastructure development, and overall technological maturity vary wildly between countries. TCB DataBroadhead pairing highlights challenges of market data management In the latest Waters Wrap, Anthony Malakian looks at the recent release of TCBs new market data administration platform, powered by Broadheads Digital Rights for Data Management, a distributed-ledger technology (DLT)-based digital contracts engine. The vendors hope that combining TCBs established reporting infrastructure with DRDMs digital contract and auditing technology will help users with market data rights management. However, skepticism of blockchains suitability for this remains, and rightfully so, Tony writes. People Moves: DTCC, Fenergo, Propellant, LG, and more A look at the past months people moves in the capital markets technology and data space, including Rimes, tZERO, DTCC, and more. Scientology-Linked Startup Dream Exchange Loses Bid for SEC License, The Wall Street Journal The US Securities and Exchange Commission (SEC) rejected Dream Exchanges application for a license to run a stock exchange two months after The Wall Street Journal reported on the start-ups undisclosed financial ties to the Church of Scientology. The SEC said its decision was based on non-public information from an investigation into potential securities-law violations, as well as press reports raising questions about the potential misuse of funds. Dream Exchange is a Chicago-based startup that is seeking to become the USs first majority Black-owned stock exchange. It also seeks to establish itself as a venture exchange to list and trade small to mid-sized, early-stage company stock. In an order posted by the SEC, the regulator said although it hasnt made any determinations in connection with the investigation, the information currently before the Commission raises questions about DreamExs capacity to operate as a stock exchange. On Monday, Dream Exchange announced that it will promptly refile its application to register as a national securities exchange following the order denying its current Form 1 application. Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "risk-management",
      "data-management",
      "technology",
      "operations",
      "regulation",
      "trading",
      "portfolio"
    ],
    "relevance_score": 5,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/data-management/7952850/tcb-data-broadhead-pairing-highlights-challenges-of-market-data-management",
    "title": "TCB Data-Broadhead pairing highlights challenges of market data management",
    "date_published": "2025-04-12",
    "author": null,
    "summary": "Waters Wrap: The vendors are hoping that blending TCB’s reporting infrastructure with Broadhead’s DLT-backed digital contract and auditing engine will be the",
    "full_text": "When TCB Data Systems was created in the late 1980s, market data inventory reports were sent to the data publishers via the US Postal Service. Thomas Butts and his co-founders had a vision of automating this important but time-consuming process. Flash forward more than three decades, and Broadhead Technologies Alan Ross had a similar itch, this time to revolutionize data entitlements. But instead of using basic computers to do it, Ross set his sights on distributed ledger technology (DLT). It was Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "data-management",
      "technology"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/data-management",
    "title": "Data Management",
    "date_published": "2026-08-01",
    "author": null,
    "summary": "Latest Data Management articles on risk management, derivatives and complex finance",
    "full_text": "",
    "tags": [
      "risk-management",
      "data-management"
    ],
    "relevance_score": 2,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/emerging-technologies/7952831/robeco-tests-credit-tool-built-in-bloombergs-python-platform",
    "title": "Robeco tests credit tool built in Bloombergs Python platform",
    "date_published": "2025-01-12",
    "author": null,
    "summary": "This follows the asset manager’s participation in Bloomberg’s Code Crunch hackathon in Singapore, alongside other firms including LGT Investment Bank and",
    "full_text": "Dutch asset manager Robeco is currently testing a credit cross-currency relative-value tool it built using BQuant, Bloombergs Python-based data science and analytics platform. The offering, which seeks to generate alpha by exploiting cross-currency spread differentials between bonds issued by the same issuer in different currencies, was built during Bloombergs first Code Crunch Hackathon in Singapore, which concluded in October. The Robeco team, represented by Randall Ho, credit analyst, and Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "technology"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/trading-tech/7952829/fca-eyes-equities-tape-openai-and-capco-team-up-prediction-markets-gain-steam-and-more",
    "title": "FCA eyes equities tape, OpenAI and Capco team up, prediction markets gain steam, and more",
    "date_published": "2025-11-21",
    "author": null,
    "summary": "The Waters Cooler: More tokenization, Ediphy lawsuit updates, Rimes teams up with Databricks, and more in this week’s news roundup.",
    "full_text": "Nyela Graham Waters Cooler The best Thanksgiving side is mashed potatoes. I will not debate this. Now the news. FCA proposes equity CT to bolster UKs competitiveness The Financial Conduct Authority (FCA) has launched a consultation on proposals to introduce a UK equity consolidated tape to help increase capital investment and liquidity in equity markets. The new framework aims to improve market effectiveness by providing a view of trading volumes and prices across UK venues, support UK listings by giving firms and investors a more complete picture of liquidity, and increase participation in UK markets by ensuring easy and affordable access to market data. The consultation is seeking feedback on introducing a tape that includes both post-trade data and the attributed best-bid-and-offer prices (the first level of pre-trade data) across UK trading venues. The equity tape aims to be operational in 2027. After two years of operation, the FCA will review the frameworks effectiveness, including whether pre-trade data levels should be varied. Pisces operator approved by FCA in push for growth The FCA has approved JP Jenkins to operate a Pisces platform, a new type of private stock market that aims to connect buyers and sellers to trade shares in private companies on an intermittent basis. The FCA provides pre-application and application support services for all potential Pisces operators. So far, the regulator has issued two approvals, with the first being the London Stock Exchange. Read WatersTechnologys previous coverage of Pisces here. LSEG integrates with Google Clouds Vertex AI platform LSEG has announced that customers will be able to access its cloud-based historical tick data via Google Clouds BigQuery and Vertex AI platform. This integration enables financial institutions to apply AI and machine learning technology directly to LSEG tick history data available on Vertex AI, providing users with data and intelligence to inform trading and risk management. Vertex AI is Google Clouds fully managed, unified AI development platform for building and using AI. With Vertex AI, LSEG aims to deliver several advantages to customers with access to LSEG tick history on Google Cloud, including accelerated processing and agentic AI adoption. Deutsche Börse partners with SocGen on tokenization Deutsche Börse Group, Societe Generale, and Societe Generale-Forge have signed an agreement to accelerate the integration of token-based cash solutions with traditional market infrastructure. The integration of SG-Forges CoinVertible as a payment and settlement stablecoin will aim to foster financial innovation in both groups. The initial focus of the partnership is on strengthening CoinVertibles collateral management structure and usability as a settlement instrument for securities processes, for collateral management and treasury functions at Clearstream, Deutsche Börses post-trade business. This partnership will also improve CoinVertibles liquidity through a new listing on Deutsche Börse digital trading platforms. Further steps will include jointly analyzing the possibility of integrating the EUR and USD CoinVertible stablecoins across the entire service portfolio of Deutsche Börse Group, enlarging use cases for MiCA-compliant stablecoins natively suitable for financial institutions and the broader cryptocurrency industry. OpenAI and Capco announce partnership Global management and technology consultancy Capco has joined OpenAIs Beta Services Partner Program, providing Capco with priority access to the very latest in AI innovation. Capco and OpenAI will collaborate to solve complex client problems and deploy scalable solutions. Through the services partnership, Capco gains early access to OpenAIs technology, technical support, solution architects, and training resources. OpenAI will leverage Capcos 25 years of global transformation expertise and delivery experience across the financial services and energy sectors. Capcos AI Lab previously used OpenAIs technology to build its Compliance Assist tool, which helps banks scan upcoming regulatory changes and automatically identify the changes to a firms processes and procedures that are required. Capco and OpenAI will explore how OpenAIs GPT-5 offering of improved contextual understanding and fine-tuning can further automate and streamline processes. TS Imagines TradeSmart now on Temenos Exchange TS Imagine, a provider of front-office trading solutions for capital markets, has announced that TradeSmart is available on Temenos Exchange, the partner ecosystem of fintech solutions hosted by Temenos. TradeSmart enables global financial institutions to trade across all asset classes with all their counterparties through a single integrated solution. TradeSmart leverages TS Imagines global network of liquidity providers, brokers and venues, and offers execution tools, real-time market data, and analytics across 25 million financial instruments. Rimes partners with Databricks to deliver managed data services Rimes, a provider of enterprise data management and investment intelligence solutions to the global investment community, is partnering with Databricks to make Rimes Managed Data Services available natively on the Databricks Data Intelligence Platform. The partnership leverages Delta Sharing, the open-source protocol for secure data exchange, enabling users to access and integrate Rimes data directly within their Databricks environments. Through this partnership, Rimes customers will be able to connect to their structured datasets without replication, reducing latency and accelerating access to AI-ready data. The combination of Rimes domain expertise in investment data and Databricks open, unified platform and flagship AI products, such as Agent Bricks, will improve financial institutions ability to optimize analytics, automate workflows, and drive new levels of data intelligence with operational efficiency. Broadridge, Xceptor partner on tax reclaims and asset servicing operations Broadridge Financial Solutions has partnered with Xceptor, a data automation platform, to offer a unified digital platform automating the global tax relief and tax reclaim lifecycle. With this partnership, Xceptor Tax will be integrated with Broadridges Global Tax  Client Reporting Solution to create a solution for multi-jurisdictional tax relief at source, tax reclaims, and digital regulatory filing. Built on Broadridges integrated platform technology and Xceptors configurable and enterprise-grade platform, the combined solution enables easy connection and out-of-the-box integration with existing systems. Through automated data flows, centralized documentation, and regulatory updates, clients can automatically identify relief-at-source and tax reclaim opportunities, monitor eligibility, and manage tax documentation. 50 of firms are using AI or ML to spot data quality issues Initial results from our Automation in Data Management Benchmark were made public this week. According to our survey, which is still open, roughly half of banks use AI and machine learning to spot data quality issues. But most issues, about 75, are remediated without the help of emerging technologies. If you are a bank and would like to participate in our inaugural benchmark, email emmahilary.gouldinfopro-digital.com to receive a link. Technology alone is not enough for Europes T1 push With Europe moving to T1 settlement in two years, the pressure is on to improve operational efficiency. Technologies like AI and automation can offer some relief, but cant do it all. Trade associations such as ISITC are looking at the lessons learned from the T1 transition in the US to aid the October 2027 switchover. Stakeholders across the industry agree that more focus and communication around the back office can serve as a major lift. FCA files to lift UK bond tape suspension, says legal claims without merit This week, the Financial Conduct Authority filed an application with the UKs High Court to lift the suspension placed on the bond tape process, which came after London-based fintech Ediphy contested the regulators decision to award the tape contract to rival Etrading Software. We welcome the FCAs application to lift the automatic suspension. The application is a strong signal to market participants to continue their preparations for the launch of the UK tape, while the legal challenge proceeds in parallel, says Sassan Danesh, CEO of Etrading Software. Ediphys complaints include an alleged conflict of interest at the FCA and a belief that the fundamental mechanism of the tender process, which was run as a reverse auction, was flawed. Ediphy is the leading member of consortium FairCT, which lost the UK race but was awarded the contract for the EUs version of a fixed income consolidated tape in July. FairCT is backed by FactSet, Google Cloud, Norges Bank Investment Management, TP Icap, and UBS. Chicago exchange group Cboe Global Markets dropped its involvement in the initiative before Ediphy filed its case, according to a person familiar with the matter. Waters Wavelength Ep. 339: Northern Trust Asset Managements Jan Rohof This week, Jan Rohof from Northern Trust Asset Management joins the podcast to discuss how asset managers and quants can get more context from data. Jump Trading spinoff Pyth enters institutional market data After launching in 2021, Pyth Network is now looking to compete more directly with institutional market data providers. In September, the peer-to-peer network launched Pyth Pro, a subscription service for market data across crypto, equities, fixed income, commodities and foreign exchange. It comes at a time when traditional firms are increasingly tiptoeing toward decentralized technologies such as asset tokenization, which has lately received frenzied attention from the worlds largest names in financial services. Pyths model gathers market data directly from exchanges, data vendors and trading firms, aggregates it under the applicable symbols, and makes it available on-chain. Publishers include familiar names Jump, Jane Street, Susquehanna, IEX, MEMX, Two Sigma, and Cboe Global Markets, while crypto publishers include Kaiko, LMAX, OKX, Talos, and Binance. Buy-side data heads push being on right side of GenAI At a Bloomberg event in London this week, tech executives from Man Group and Systematica Investments outlined the areas where generative AI is serving their firms best. Grégoire Dooms, head of data research and development at Systematica Investments, said advancements in GenAI were proceeding incredibly quickly, and had significantly changed the way the firm interacted with unstructured datasets. Dooms explained that the technology had lowered the bar to accessing and processing unstructured textual data. Tushara Fernando, head of data and machine learning at Man Group, said GenAI was the biggest thing since the internet and was fundamentally changing how processes were thought about and optimized at the hedge fund. AI enthusiasts are running before they can walk There is something about flashy new technology that makes some users want to run before they can walk. AI is proving to be no exception. In this weeks IMD Wrap, Wei-Shen lays out what is tripping organizations up when it comes to utilizing the technology. Spoiler alert: its nothing new. Prediction Markets to Rival Stocks Within Years, Kalshi CEO Says, Bloomberg At the Futures Industry Association Expo conference in Chicago this week, Kalshi CEO Tarek Mansour said the rapid growth in prediction markets this year has put the emerging market on track to overtake the stock market. Obviously, Mansour has an agenda to push as he angles for his platform to lead that market. But I wouldnt be surprised if competitors like Polymarket agree with that sentiment. If you follow the money, I dont think its a bad bet. Intercontinental Exchange announced a strategic investment in Polymarket last month to the tune of 2 billion. The investment includes Ice becoming a global distributor of Polymarkets event-driven data and providing customers with sentiment indicators on topics of market relevance. Additionally, Ice and Polymarket have agreed to partner on future tokenization initiatives. Kalshi has already inked a partnership with Robinhood Markets in a push to get its event contracts in front of more eyes. And more traditional names like CME are also creeping in. Last week, the derivatives exchange group announced a deal with online gaming giant FanDuel to launch prediction markets through the new FanDuel Predicts app, slated to go live next month. If Terry Duffy is interested, I think that is worth noting. Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "risk-management",
      "hedge-fund",
      "data-management",
      "technology",
      "operations",
      "regulation",
      "trading",
      "portfolio"
    ],
    "relevance_score": 3,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/emerging-technologies/7952825/buy-side-data-heads-push-being-on-right-side-of-genai",
    "title": "Buy-side data heads push being on right side of GenAI",
    "date_published": "2025-11-19",
    "author": null,
    "summary": "Data heads at Man Group and Systematica Investments explain how GenAI has transformed the quant research process.",
    "full_text": "At Bloombergs London offices on Wednesday, heads of data at funds and banks reflected on the dramatic changes that widespread use of AI has had on internal workflows. Tushara Fernando, head of data and machine learning at Man Group, said generative AI was the biggest thing since the internet and was fundamentally changing the way that processes were thought about and optimized at the hedge fund. Man Groups CTO, Gary Collier, had said in September that the firm was already seeing actionable Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "hedge-fund",
      "technology"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/regulation/7952811/technology-alone-is-not-enough-for-europes-t1-push",
    "title": "Technology alone is not enough for Europes T1 push",
    "date_published": "2025-11-17",
    "author": null,
    "summary": "Testing will be a key component of a successful implementation. However, the respective taskforces have yet to release more details on the testing schedules.",
    "full_text": "Last year, all eyes turned to North America as the settlement cycle for the US, Canada, and Mexico was shortened by a day. This year, that focus has shifted to the UK and EUs move to T1, expected in October 2027. While the use of technologies such as artificial intelligence, straight-through processing, and automation in workflows and processes aim to improve operational efficiency, some believe these solutions alone arent enough to address the myriad complexities involved in the UKEU move. Ri Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "technology",
      "operations"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/regulation",
    "title": "Regulation",
    "date_published": "2026-08-01",
    "author": null,
    "summary": "Latest Regulation articles on risk management, derivatives and complex finance",
    "full_text": "",
    "tags": [
      "risk-management",
      "regulation"
    ],
    "relevance_score": 2,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/data-management/7952786/maystreet-founder-says-lseg-abandoned-integration-in-new-court-filing",
    "title": "MayStreet founder says LSEG abandoned integration in new court filing",
    "date_published": "2025-04-11",
    "author": null,
    "summary": "In response to LSEG’s motion to dismiss a lawsuit filed by the founder of one of its acquired companies, lawyers for Patrick Flannery have offered more details",
    "full_text": "Lawyers for MayStreet founder and former CEO Patrick Flannery have fired back at London Stock Exchange Group in an 89-page amended complaint amid the formers ongoing lawsuit for fraud and breach of contract. The amended complaint, with new details pertaining to conversations between Flannery, his team, and LSEG executives, comes after LSEG filed to dismiss the suit in September. Flannery filed his original complaint against LSEG in Delawares Court of Chancery on May 16, accusing the exchange Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "technology"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/trading-tech/7952777/as-outages-spread-its-time-to-rethink-how-we-view-infrastructure-technology",
    "title": "As outages spread, its time to rethink how we view infrastructure technology",
    "date_published": "2025-10-31",
    "author": null,
    "summary": "Waters Wrap: First AWS and then Azure. And these are only the most recent of significant outages. Anthony says a change is needed when it comes to calculating",
    "full_text": "Last week, Amazon Web Services experienced a major outage. Not wanting to be left out, Microsoft Azure went down this week. And if you believe some experts, these outages will only become more commonplace due to AI usage and changing weather patterns. Ever since the first datacenter, outages have been the bane of every IT professional. When things run smoothly, no one notices. When shit hits the fan, the immediate response is rage. My dad ran datacenters for decades, and he was constantly called Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "technology"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/trading-tech/7952774/llm-firms-come-for-finance-bmll-gets-bought-lseg-users-get-preqin-feeds-and-more",
    "title": "LLM firms come for finance, BMLL gets bought, LSEG users get Preqin feeds, and more",
    "date_published": "2025-10-31",
    "author": null,
    "summary": "The Waters Cooler: Tradeweb completes fully electronic RFM swaptions trade, IBM cashes in on digital asset mania, and more frights and delights in this week’s",
    "full_text": "Rebecca Natale Ion Group Emerging Technologies Waters Cooler Black cats and golden leaves, Glowing lanterns, and wicked deeds. Thin as a razor, the veil will be; The witching hour dawns, as the clock strikes three. Happy Halloween, from my house to yours. Nordic Capital to acquire BMLL for 250 million Private equity investor Nordic Capital has agreed to acquire BMLL, a provider of historical order book data and analytics, for 250 million. The investment will be made in close partnership with the management team of BMLL and Optiver, a minority shareholder and market-maker. BMLL intends to use this investment to further expand global venue coverage, extend historical depth, and grow multi-asset class capabilities, giving the market a differentiated alternative to the incumbent market data providers. With Nordic Capitals support, BMLL will seek to strengthen its go-to-market capabilities and partnerships with exchanges, technology platforms, and market infrastructure providers. The existing management team, led by CEO Paul Humphrey, will continue leading the business and remain shareholders. LSEG, Anthropic partner on financial data for enterprise Claude users The London Stock Exchange Group has partnered with Anthropic to grant access to data licensed through LSEG products, like Workspace and Financial Analytics, to Claude customers. This will be available through Anthropics newly expanded Claude for Financial Services offering. LSEG is giving access to data licensed through its products like Workspace and Financial Analytics so customers can automate financial analysis. LSEGs AI-ready content will be accessible through Anthropics Model Context Protocol (MCP) in a phased rollout, starting with LSEG Financial Analytics. LSEG will also grant Claude users access to more licensed AI-ready content, with initial capabilities launching later this month and additional data categories to follow. Through this collaboration, LSEG and Anthropic are also embedding mutual lead generation processes. Claude for Financial Services customers can augment their existing data with licenses for LSEGs flagship Workspace solution. LSEG is partnering with Workspace customers to secure licensed enterprise access to Claude. Ions Fidessa integrates with LSE Pisces Ion, a provider of fixed-income and derivatives trading software, announced that its Fidessa platform will support auction events on the London Stock Exchanges Private Securities Market. Operating under the Private Intermittent Securities and Capital Exchange System (Pisces) framework, the new secondary market will provide private companies and their shareholders with access to intermittent liquidity auctions leveraging the London Stock Exchanges public markets infrastructure. Transactions on the platform will be exempt from stamp duty, reducing costs and simplifying the trading process. IBM debuts Digital Asset Haven for institutions and regulated entities IBM has launched IBM Digital Asset Haven, a platform for financial institutions, governments, and corporations to securely manage and scale their digital asset operations. Banks and governments now have a single solution to manage their digital asset lifecyclefrom custody to transactions to settlementthat helps them meet compliance obligations while being integration-ready. Developed in collaboration with DFNS, a digital wallet infrastructure provider, IBM Digital Asset Haven integrates the full-stack infrastructure and security of IBM with DFNS digital asset custody and management capabilities. The DFNS platform has created 15 million wallets for more than 250 clients. Third Bridge integrates data with Anthropics Claude for Financial Services Research provider Third Bridge, in collaboration with Aiera, has integrated with Anthropics Claude for Financial Services solution. The partnership incorporates Third Bridges corpus of proprietary interview transcripts, making these insights immediately available within Claude. The integration leverages Aieras Model Context Protocol server to incorporate Third Bridges qualitative data into Claudes agentic AI research capabilities. Third Bridges insights can be incorporated alongside market data, internal systems, and proprietary models. Tradeweb advances swaptions electronification via new protocol Tradeweb Markets has completed the first fully electronic request-for-market (RFM) swaption package trade. Citadel and Barclays were counterparties on the trade, which was executed recently on the Tradeweb Swap Execution Facility (TW SEF). The execution of this trade enables institutional clients on TW SEF to request and receive a two-way market, rather than a price based on one direction, for a series of swaptions and swaps in a single electronic quote. This is especially beneficial for derivatives market participants, as it enhances transparency while simultaneously protecting client intent, and shares potentially sensitive or strategically valuable trading information exclusively between counterparties. SSC introduces AI agent catalogue SSC Technologies has launched its AI agent catalogue for financial services and healthcare firms. The outcome-focused AI agents are designed to simplify complex operations such as credit processing and contract validation. Delivered as a managed service, the agents help organizations overcome talent shortages and operational bottlenecks securely and at-scale. One of the first customers to evaluate an SSC AI Agent is American Life, a carrier in the annuity and retirement space based in Lincoln, Nebraska. The firm is leveraging and evaluating SSCs Credit Agreement Document Agent to streamline processing within its private credit operations. The AI agent continuously reviews and updates lengthy loan documents, cutting time and errors associated with manual review. SSC saw a significant reduction in credit processing times within internal operations by using the technology. Eventus, Treliant collaborate for enhanced trade surveillance Eventus, a provider of trade surveillance and financial risk solutions, is collaborating with Treliant, a global consulting and managed services firm recently acquired by Huron Consulting Group. The relationship between Eventus and Huron will deliver enhanced trade surveillance capabilities for global financial institutions. The collaboration provides specialized support for Eventus clients leveraging its Validus surveillance platform. While Eventus provides platform delivery, technology support, and surveillance expertise, Treliant enhances the ecosystem by enabling clients to optimize and govern their surveillance environments. Under this collaboration, Eventus clients can engage directly with Treliant to strengthen their surveillance frameworks by conducting risk assessments, tuning alert logic, receiving best practice guidance, and getting managed-service support. BlackRock enhances LSEG private markets offering with Preqin datafeeds London Stock Exchange Group has expanded its partnership with BlackRock, strengthening LSEGs private markets intelligence offering. Through a new advanced data integration, LSEGs customers will gain deeper insights into private markets and alternative assets by accessing Preqin data through LSEGs Workspace platform, data, and feeds products. The addition of private markets data enhances LSEGs data across public and private markets and brings Preqins private markets data to a new category of investors. In parallel, LSEG and BlackRock have also deepened their data integrations in two other areas. LSEG has renewed its multi-year partnership with BlackRocks Aladdin platform, bringing platform access to LSEGs pricing and reference services data to power their investment decisions. BlackRock has also extended its partnership with FTSE Russell, enabling BlackRock to continue to license the trusted index providers benchmarks to create a variety of investment vehicles for its clients. Experts urge banks to prep for quantums reckoning Some industry experts and mathematicians peg Q-Day, the day that a large-enough and stable-enough quantum computer is able to break modern encryption methods, as only five years away. In this story, execs from Symphony, Protiviti, and cyber firm Lastwall urge banks to start preparing yesterday and stop kicking the can down the road. If they dont, all their precious, regulated secrets may become public domain. SIX, ViaNexus build market data platform to unite data consumers, producers European exchange operator SIX Group and ViaNexus, the new iteration of what was formerly IEX Cloud, are teaming up to build a market data distribution platform that, if successful, will give SIX more command over its data products and users some freedom from convoluted and restrictive licensing structures. The platform, projected to be released next year, will function as a data marketplace, with users able to purchase datasets by the slice and be immediately entitled to use it. The spirit of the project is encapsulated by a number of feel-good words: access, ease, agility, democratization. But make no mistake: its also, centrally, about control. TMXs CEO wonders if tokenization is a solution looking for a problem If it exists, make it a token. Tokenization has been a hot topicrivaling that of artificial intelligencein this years spate of Q3 earnings calls. But the CEO of Canadian exchange group TMX, John McKenzie, seemed to offer a somewhat contrarian perspective on his firms quarterly call with shareholders. Despite having initiated several pilot programs, McKenzie says the technology has appeared to be a solution looking for a problem, a sentiment not dissimilar to that which was said after the blockchain mania seen a few years ago. Our marketplaces are prepared, but the use case is still a question mark in terms of the value add, he said. MSCI CEO: Vendor feverishly infusing every aspect of MSCI with AI During its Q3 earnings call, CEO Henry Fernandez said that since the launch of OpenAIs ChatGPT three years ago, MSCI has feverishly been looking into and permeating every aspect of MSCI with AI. MSCI has spent the last nine months working on tools that can help investors understand the ins and outs of their funds, focusing on creditworthiness, market risk, valuations, and terms and conditions of underlying loans. It will next look to develop evaluated prices in private credit. Much of this work is underpinned by AI, which Fernandez called a godsend. Row breaks out over cause of FX settlement fails An unnamed European bank is claiming to have seen a 50 increase in the rate and size of foreign exchange settlement fails over the past year, which it blames on the move to T1 settlement in North America on May 28, 2024. But reps for industry groups GFMA and the UKs T1 Taskforce, as well as post-trade utility Osttra, are scratching their heads, having found that almost all their members have not reported anything similar. Thats not to say that no firms have experienced settlement problems, but there are other culprits to consider: rising volatility, market stress, and a greater need for precision, especially for those in certain time zones, like the US West Coast and Asia Pacific. DTCC revamps tech abilities following global reporting overhaul The Depository Trust  Clearing Corporations Repository  Derivatives Services (RDS) is leveraging new forms of technology to upgrade the process of trade reporting and its clients workflows. Michelle Hillery, managing director and head of RDS, sat down with WatersTechnology to detail the clearing houses early testing simulator, global standardization of critical data elements, and its new use of natural-language interfaces for error investigation and correction. OpenAI looks to replace the drudgery of junior bankers workloads, Bloomberg News Those who were here in 2022 may remember when our editor, Tony, in a Waters Wrap, warned fintechs that Big Tech firms were coming for their toys. The first domino fell in November 2021, when Google invested 1 billion into Chicago derivatives exchange group CME, which promised to migrate its entire tech stack to Google Cloud. Nasdaq went next, announcing a near-replica deal with Amazon Web Services that same month. The dominoes never really stopped falling. Well, its happening again. But this time, the next generation of Big Techthat is, the large language model (LLM) providersis coming for this industry. In this column alone, Anthropic, which released Claude for Financial Services in July, gets its paws on LSEG and Third Bridge. And in the Bloomberg story linked above, youll find that OpenAI, the father of ChatGPT, has hired 100 ex-investment bankers to train its AI to build financial models as part of a secretive project, code-named Mercury. Mercury participants include former employees of Goldman Sachs, JP Morgan, and Morgan Stanley, and the project involves almost no human interaction. Instead, these contributors are paid 150hour to write prompts and build financial models for a range of transaction types. OpenAI has also granted the contractors early access to the AI its creating, which aims to replace entry-level tasks at investment banks. Seems quite grim, but also a little funny. This is the second time in less than five years that the industry that somehow believes itself to be a thriving and cutting-edge tech sector is getting got by the actual tech sector, while pretending to be best friends. Will sanity ever prevail? The mild-mannered Englishman who was the worlds most prolific ghost hunter, LitHub A Halloween Cooler wouldnt be complete without a ghost storymy favorite kind of story. In this excerpt from Ben Machells Chasing the Dark: A 140-Year Investigation of Paranormal Activity, Machell details some of the unexplainable cases investigated by Tony Cornell, a skeptical Cambridge man who studied telepathy, paranormal activity, and other areas of psychic research in the latter half of the 20th century. Ghost stories are found all over the world, in different flavors but with remarkably similar textures. They are a thread that runs through all stripes of geographies, religions, ethnicities, and time periods, and they reveal to us our anxieties and hopes. In fact, my hometown, a small dot in upstate New York, has its own White Lady, a common figure in folklore that usually appears as a woman in a long, white, flowing gown. We call her Widow Susan. I believe in ghosts, literally and figuratively. After all, what is a memory, if not a ghost? Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "risk-management",
      "technology",
      "operations",
      "regulation",
      "trading"
    ],
    "relevance_score": 3,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/trading-tech/7952771/tmxs-ceo-wonders-if-tokenization-is-solution-looking-for-a-problem",
    "title": "TMXs CEO wonders if tokenization is a solution looking for a problem",
    "date_published": "2025-10-28",
    "author": null,
    "summary": "While acknowledging the potential of tokenizing securities, John McKenzie said regulators shouldn’t move too fast, and let customer demand drive adoption.",
    "full_text": "During the Q3 earnings call season, tokenization has been a prominent topic for several CEOs. In recent weeks, BlackRocks Larry Fink has taken an aggressive, pro-adoption stance; Nasdaqs Adena Friedman, on the other hand, has taken a more moderate, though still pro, position. TMX Group has also been exploring the virtues of tokenization, with pilot projects to explore tokenized securities being traded on the exchange and for custody and clearing. The exchange operators CEO, John McKenzie Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "technology",
      "regulation",
      "portfolio"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/trading-tech/7952760/bolsa-mexicana-embarks-on-multi-year-modernization-project",
    "title": "Bolsa Mexicana embarks on multi-year modernization project",
    "date_published": "2025-10-21",
    "author": null,
    "summary": "Latin America’s second largest exchange is embracing cloud and upgrading its infrastructure in a bid to bolster its global standing, says CEO.",
    "full_text": "The origins of Bolsa Mexicana de Valores (BMV) can be traced to the streets of Plateros and Cadena in downtown Mexico City, where in 1880, brokers and entrepreneurs would meet to buy and sell various commodities and stocks. Soon, the brokers began organizing, and by the turn of the 20th century, Bolsa de México was an incorporated entity. In 1975, it was rebranded the Bolsa Mexicana de Valores (BMV), or the Mexican Stock Exchange, after merging the poorly performing Guadalajara and Monterrey Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "risk-management",
      "technology",
      "regulation"
    ],
    "relevance_score": 2,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/trading-tech/7952756/sp%E2%80%99s-18b-buy-an-fia-restructure-a-tokenization-craze-and-more",
    "title": "SPs 1.8 billion buy, an FIA restructure, a tokenization craze, and more",
    "date_published": "2025-10-17",
    "author": null,
    "summary": "The Waters Cooler: CAIS creates CAISey, BNY deploys EquiLend, and more in this week’s news roundup.",
    "full_text": "Im very excited for the 2026 World Cup. International football tournaments are the closest I feel to euphoria. We do sweepstakes, we watch games in the pub, sing all the songs, and sob into a pint when England inevitably screws up. The full gamut of emotions. England qualified this week, having not conceded a goal in all our games. An aging Ronaldo and Messi, our best players in peak form, and our rival teams checkered qualifying campaigns make it feel like England is primed for its first Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "technology"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "waterstechnology",
    "url": "https://www.waterstechnology.com/trading-tech/7952749/bloomberg-integrates-ai-summaries-into-port",
    "title": "Bloomberg integrates AI summaries into Port",
    "date_published": "2025-10-15",
    "author": null,
    "summary": "One buy-side user says that while it’s still early for agentic tools, they’re excited by what they’ve seen so far.",
    "full_text": "Bloomberg has added AI-powered portfolio commentary to its risk analytics and portfolio offering, Port Enterprise. The new feature streamlines the time-consuming manual processes of creating analyses and other content on subjects like market shifts, investment strategy insights, and economic trends. It allow investment writers at asset managers, hedge funds, and other buy-side firms to create summaries of investment decisions, using both subscribed-to Bloomberg data, as well as news reports from Only users who have a paid subscription or are part of a corporate subscription are able to print or copy content. To access these options, along with all other subscription benefits, please contact infowaterstechnology.com or view our subscription options here: https:subscriptions.waterstechnology.comsubscribe You are currently unable to print this content. Please contact infowaterstechnology.com to find out more. You are currently unable to copy this content. Please contact infowaterstechnology.com to find out more. Copyright Infopro Digital Limited. All rights reserved. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (point 2.4), printing is limited to a single copy. If you would like to purchase additional rights please email infowaterstechnology.com Copyright Infopro Digital Limited. All rights reserved. You may share this content using our article tools. As outlined in our terms and conditions, https:www.infopro-digital.comterms-and-conditionssubscriptions (clause 2.4), an Authorised User may only make one copy of the materials for their own personal use. You must also comply with the restrictions in clause 2.5. If you would like to purchase additional rights please email infowaterstechnology.com",
    "tags": [
      "risk-management",
      "hedge-fund",
      "technology",
      "portfolio"
    ],
    "relevance_score": 3,
    "is_paywalled": false
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/risk-management/7948611/inflation-scenarios-pt-ii-end-of-the-party",
    "title": "Inflation scenarios, pt II: end of the party",
    "date_published": "2022-05-23",
    "author": null,
    "summary": "Whether inflation rises or falls, crowdsourced scenarios forecast huge range of outcomes",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/risk-management/7893436/climate-scenarios-carbon-price-shock-sees-asset-prices-slump",
    "title": "Climate scenarios: carbon price shock sees asset prices slump",
    "date_published": "2021-08-11",
    "author": null,
    "summary": "Crowdsourced scenario analysis suggests very few sectors safe from a post-COP carbon price pop",
    "full_text": null,
    "tags": [
      "regulation"
    ],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/risk-management/7889376/inflation-scenarios-tail-risks-loom-for-us-equities",
    "title": "Inflation scenarios: tail risks loom for US equities",
    "date_published": "2021-10-22",
    "author": null,
    "summary": "Portfolios could lose more than one-third of their value if inflation stays high, suggests crowdsourced scenario exercise",
    "full_text": null,
    "tags": [
      "portfolio"
    ],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/risk-management/7701701/us-election-scenarios-meltdown-fears-if-poll-contested",
    "title": "US election scenarios: meltdown fears if poll contested",
    "date_published": "2020-10-28",
    "author": null,
    "summary": "Crowdsourced election scenarios show sharp falls and correlation breaks if Trump challenges results",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/markets/7962104/barclays-braces-for-a-macro-storm",
    "title": "Barclays braces for a macro storm",
    "date_published": "2025-02-09",
    "author": null,
    "summary": "Talking Heads 2025: Developed markets are racking up debt. Finding buyers could be difficult, says macro head Hossein Zaimi",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/regulation/7962256/how-staff-exodus-could-leave-the-occ-high-and-dry",
    "title": "How staff exodus could leave the OCC high and dry",
    "date_published": "2025-01-10",
    "author": null,
    "summary": "A third of staff set to depart US regulator, but some teams will suffer much heavier losses",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/markets/7962099/eurex-plans-october-launch-for-qis-futures",
    "title": "Eurex plans October launch for QIS futures",
    "date_published": "2025-01-09",
    "author": null,
    "summary": "Long-only European equity strategies will be first out of the gate, with more to come",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/markets/7962126/brevan-howard-life-beyond-macro",
    "title": "Brevan Howard: life beyond macro",
    "date_published": "2025-09-09",
    "author": null,
    "summary": "Talking Heads 2025: Wider range of strategies helped firm rebound from 2018 low – but brought re-correlation risks",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/regulation/7962124/some-european-banks-still-failing-net-interest-income-test",
    "title": "Some European banks still failing net interest income test",
    "date_published": "2025-09-15",
    "author": null,
    "summary": "Swedbank joins seven other outliers after it updates methodology assumptions",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/risk-management/7956128/top-10-operational-risks-for-2023",
    "title": "Top 10 operational risks for 2023",
    "date_published": "2023-08-03",
    "author": null,
    "summary": "The biggest op risks for the year ahead, as chosen by senior industry practitioners",
    "full_text": null,
    "tags": [
      "operations"
    ],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/quantitative-finance/7955680/quant-finance-masters-guide-2023",
    "title": "Quant Finance Masters Guide 2023",
    "date_published": "2023-05-23",
    "author": null,
    "summary": "Risk.net’s guide to the world’s leading quant master’s programmes, with the top 25 schools ranked",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/investing/7958628/risknets-top-10-investment-risks-for-2024",
    "title": "Risk.nets top 10 investment risks for 2024",
    "date_published": "2024-03-01",
    "author": null,
    "summary": "New fears include mounting government debt, the rise of AI, a credit crunch and regulatory overkill",
    "full_text": null,
    "tags": [
      "regulation"
    ],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/risk-management/7962723/risk-managers-question-us-reach-of-dora-third-party-list",
    "title": "Risk managers question US reach of Dora third-party list",
    "date_published": "2026-06-01",
    "author": null,
    "summary": "Some EU subsidiaries included, but regulator control over cloud providers could still be limited",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/risk-management/7962125/dora-delay-leaves-eu-banks-fighting-for-their-audit-rights",
    "title": "Dora delay leaves EU banks fighting for their audit rights",
    "date_published": "2025-10-09",
    "author": null,
    "summary": "Regulation requires firms to expand scrutiny of critical vendors that haven’t yet been identified",
    "full_text": null,
    "tags": [
      "regulation"
    ],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/risk-management/7962039/ecb-may-force-banks-to-rethink-cloud-just-months-after-dora",
    "title": "ECB may force banks to rethink cloud just months after Dora",
    "date_published": "2025-08-19",
    "author": null,
    "summary": "EU regulator pushes multi-cloud strategy for banks, but guidance will not be binding",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/regulation/7961717/eu-tipped-to-tag-less-than-30-tech-firms-as-critical-for-dora",
    "title": "EU tipped to tag less than 30 tech firms as critical for Dora",
    "date_published": "2025-06-17",
    "author": null,
    "summary": "Irish regulator suggests European supervisors will take narrower view than some feared",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/markets/7962918/one-trading-brings-247-equity-trading-to-europe",
    "title": "One Trading brings 247 equity trading to Europe",
    "date_published": "2026-08-01",
    "author": null,
    "summary": "Start-up exchange will launch perpetual futures Clob in Q1 after AFM nod",
    "full_text": null,
    "tags": [
      "trading"
    ],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/risk-quantum/7962835/lme-hit-hardest-in-boe%E2%80%99s-latest-ccp-stress-test",
    "title": "LME hit hardest in BoEs latest CCP stress test",
    "date_published": "2026-07-01",
    "author": null,
    "summary": "Cover 2 liquidation scenario wipes out more than half of default fund",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/people/7962908/citadel-securities-hires-former-eisler-cro",
    "title": "Citadel Securities hires former Eisler CRO",
    "date_published": "2026-06-01",
    "author": null,
    "summary": "Pregnell joins market-maker after demise of hedge fund",
    "full_text": null,
    "tags": [
      "hedge-fund",
      "regulation"
    ],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/regulation/7962880/credit-spread-risk-approach-differs-among-eu-banks-survey-finds",
    "title": "Credit spread risk approach differs among EU banks, survey finds",
    "date_published": "2026-05-01",
    "author": null,
    "summary": "KPMG survey of more than 90 banks reveals disagreement on how to treat liabilities and loans",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/risk-management/7962570/destabilising-is-stablecoin-deposit-drain-a-bank-funding-risk",
    "title": "Destabilising: is stablecoin deposit drain a bank funding risk?",
    "date_published": "2025-11-17",
    "author": null,
    "summary": "While some fear a trillion-dollar flight to stablecoin, others doubt crypto is an existential threat for banks",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/risk-management/7962563/ficc-to-launch-new-default-fund-before-ust-clearing-mandate",
    "title": "FICC to launch new default fund before UST repo clearing mandate",
    "date_published": "2025-11-17",
    "author": null,
    "summary": "Clearing members expected to welcome FICC’s plans to separate loss mutualisation from margin",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/regulation/7962403/industry-groups-call-on-ec-to-delay-foreign-ccp-reporting",
    "title": "Industry groups call on EC to delay foreign CCP reporting",
    "date_published": "2025-10-22",
    "author": null,
    "summary": "Trade bodies seek to prevent late-running rules causing duplicated implementation projects",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/risk-quantum/7962507/ficc-takes-record-bite-from-mmf-repo-investments",
    "title": "FICC takes record bite from MMF repo investments",
    "date_published": "2025-12-11",
    "author": null,
    "summary": "Funds shift cash from the Fed’s ON RRP as cleared repos hit $1.11trn",
    "full_text": null,
    "tags": [],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "risk.net",
    "url": "https://www.risk.net/risk-management/7962390/how-us-hedge-funds-won-big-on-permission-to-clear-at-jscc",
    "title": "How US hedge funds won big on permission to clear at JSCC",
    "date_published": "2025-10-20",
    "author": null,
    "summary": "But CFTC no-action letter won’t allow netting of Japanese trades with those cleared at US FCMs",
    "full_text": null,
    "tags": [
      "hedge-fund",
      "regulation"
    ],
    "relevance_score": 1,
    "is_paywalled": true
  },
  {
    "source_site": "hedge_fund_journal",
    "url": "https://thehedgefundjournal.com/news/hedge-funds-take-in-4-0-billion-in-may-as-strengthening-u-s-economy-boosts-investor-optimism/",
    "title": "Hedge Funds Take in 4.0 Billion in May as Strengthening US Economy Boosts Investor Optimism",
    "date_published": "2018-07-17",
    "author": null,
    "summary": "The Hedge Fund Journal is a monthly magazine focusing on the global hedge fund industry.",
    "full_text": "",
    "tags": [
      "hedge-fund"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "hedge_fund_journal",
    "url": "https://thehedgefundjournal.com/news/aspect-capital-announces-new-investment-offering/",
    "title": "Aspect Capital announces new investment offering",
    "date_published": "2018-07-02",
    "author": null,
    "summary": "The Hedge Fund Journal is a monthly magazine focusing on the global hedge fund industry.",
    "full_text": "",
    "tags": [
      "hedge-fund"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "hedge_fund_journal",
    "url": "https://thehedgefundjournal.com/news/barclay-cta-index-slips-0-24-in-may/",
    "title": "Barclay CTA Index Slips 0.24 in May",
    "date_published": "2018-06-13",
    "author": null,
    "summary": "The Hedge Fund Journal is a monthly magazine focusing on the global hedge fund industry.",
    "full_text": "",
    "tags": [
      "hedge-fund"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "hedge_fund_journal",
    "url": "https://thehedgefundjournal.com/news/stockpicking-strategies-remain-in-the-driving-seat/",
    "title": "Stockpicking Strategies Remain in the Driving Seat",
    "date_published": "2018-06-11",
    "author": null,
    "summary": "The Hedge Fund Journal is a monthly magazine focusing on the global hedge fund industry.",
    "full_text": "",
    "tags": [
      "hedge-fund"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "hedge_fund_journal",
    "url": "https://thehedgefundjournal.com/news/energy-hedge-funds-surge-to-best-gain-since-april-2016/",
    "title": "Energy Hedge Funds Surge to Best Gain Since April 2016",
    "date_published": "2018-06-08",
    "author": null,
    "summary": "The Hedge Fund Journal is a monthly magazine focusing on the global hedge fund industry.",
    "full_text": "",
    "tags": [
      "hedge-fund"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "hedge_fund_journal",
    "url": "https://thehedgefundjournal.com/news/barclay-cta-index-gains-0-23-in-april/",
    "title": "Barclay CTA Index Gains 0.23 in April",
    "date_published": "2018-05-16",
    "author": null,
    "summary": "The Hedge Fund Journal is a monthly magazine focusing on the global hedge fund industry.",
    "full_text": "",
    "tags": [
      "hedge-fund"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "hedge_fund_journal",
    "url": "https://thehedgefundjournal.com/news/asian-hedge-funds-decline-as-usd-gains-vs-yen-renminbi/",
    "title": "Asian Hedge Funds Decline as USD Gains vs YEN, Renminbi",
    "date_published": "2018-05-16",
    "author": null,
    "summary": "The Hedge Fund Journal is a monthly magazine focusing on the global hedge fund industry.",
    "full_text": "",
    "tags": [
      "hedge-fund"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "hedge_fund_journal",
    "url": "https://thehedgefundjournal.com/news/bitspread-launches-blockberry-first-managed-account-platform-for-institutions-to-invest-in-blockchain-assets/",
    "title": "BitSpread launches BlockBerry: First managed account platform for institutions to invest in blockchain assets",
    "date_published": "2018-05-16",
    "author": null,
    "summary": "The Hedge Fund Journal is a monthly magazine focusing on the global hedge fund industry.",
    "full_text": "",
    "tags": [
      "hedge-fund"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "hedge_fund_journal",
    "url": "https://thehedgefundjournal.com/news/sg-cta-indices-cta-performance-improves-marginally-in-april/",
    "title": "SG CTA Indices: CTA Performance Improves Marginally in April",
    "date_published": "2018-05-16",
    "author": null,
    "summary": "The Hedge Fund Journal is a monthly magazine focusing on the global hedge fund industry.",
    "full_text": "",
    "tags": [
      "hedge-fund"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  },
  {
    "source_site": "hedge_fund_journal",
    "url": "https://thehedgefundjournal.com/news/have-amoral-mbas-poisoned-capitalism/",
    "title": "Have Amoral MBAs Poisoned Capitalism?",
    "date_published": "2018-05-10",
    "author": null,
    "summary": "The Hedge Fund Journal is a monthly magazine focusing on the global hedge fund industry.",
    "full_text": "",
    "tags": [
      "hedge-fund"
    ],
    "relevance_score": 1,
    "is_paywalled": false
  }
]